### Terraform Plan for `prod` Environment

<details>
<summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.backend will be created
  + resource "google_artifact_registry_repository" "backend" {
      + create_time      = (known after apply)
      + description      = "Docker repository for backend service images"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe-west1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "web-app-demo-prod"
      + registry_uri     = (known after apply)
      + repository_id    = "backend"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + vulnerability_scanning_config (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @edgorman, Action: `pull_request`, Working Directory: `infrastructure/env`, Workflow: `Pull Request`*